# Dataset is Not Good, Due to Many Problems

## In this Complete Notbook we will preprocess it.

#### Installing All Dependencies

In [2]:
import pandas as pd 
import numpy as np

In [3]:
df=pd.read_csv('Titanic-Dataset.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.shape

(891, 12)

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Check any Null Values

In [7]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Already Records are less we wil not drop the Complete Row , We will Fill it with a values

In [8]:
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [9]:
## Let Worst Fill Missing Values of Age
df['Age'].fillna(df['Age'].mean(),inplace=True)

## Why we Choosed Mean?
## Because Age is Normally Distributed

### As the Whole Titanic is Drown , The Cabin does not tell anything meaninfull so we will fill it with 
### Known & Unknown

In [10]:
## If Value exists then known and otherwise unknown
df['Cabin']=df['Cabin'].apply(lambda x: 0 if pd.isna(x) else 1)

In [11]:
## Again Check Missing Values
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

## Filling Embarked with Median more repeated place

In [12]:
## Let Worst Fill Missing Values of Embarked
df['Embarked'].fillna(df['Embarked'].mode()[0],inplace=True)

## Why we Choosed Mode?
## Because Embarked is Categorical Distributed

In [13]:
## Again Check Missing Values
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### Good All Missing Values Removed , Now Next Step is to Make the Categorical Values to Numerical

## Converting Text to Numbers

In [14]:
# We will use Lablel Encoding
from sklearn.preprocessing import LabelEncoder
sexLe=LabelEncoder()
embarkedLe=LabelEncoder()


df['Sex']=sexLe.fit_transform(df['Sex'])
df['Embarked']=embarkedLe.fit_transform(df['Embarked'])

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,1,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,0,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,1,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,0,2

## Selecting Important Features

In [16]:
df.drop(['PassengerId','Name','Ticket'],axis=1,inplace=True)

In [17]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Cabin  Embarked
0         0       3    1  22.0      1      0   7.2500      0         2
1         1       1    0  38.0      1      0  71.2833      1         0
2         1       3    0  26.0      0      0   7.9250      0         2
3         1       1    0  35.0      1      0  53.1000      1         2
4         0       3    1  35.0      0      0   8.0500      0         2

## Feature Scaling Because Age is Fare is Very High as Comapre to Other Columns

In [18]:
# Feature Scaling will not change the Distribution of Data
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df[['Age','Fare']] = scaler.fit_transform(df[['Age','Fare']])

In [19]:
df.head()

   Survived  Pclass  Sex       Age  SibSp  Parch      Fare  Cabin  Embarked
0         0       3    1  0.271174      1      0  0.014151      0         2
1         1       1    0  0.472229      1      0  0.139136      1         0
2         1       3    0  0.321438      0      0  0.015469      0         2
3         1       1    0  0.434531      1      0  0.103644      1         2
4         0       3    1  0.434531      0      0  0.015713      0         2

In [20]:
# Sample Inverse Transform

scaler.inverse_transform(df[['Age','Fare']].head())

array([[22.    ,  7.25  ],
       [38.    , 71.2833],
       [26.    ,  7.925 ],
       [35.    , 53.1   ],
       [35.    ,  8.05  ]])

### Exporting to CSV

In [21]:
df.to_csv('Preprocessed_Titanic_Dataset.csv',index=False)

## Train , Test Split

In [22]:
from sklearn.model_selection import train_test_split

X=df.drop('Survived',axis=1)
y=df['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)